---
title: Exception Handler Anti-Debug Checks
technique: T1622
id: e1f2g3h4-i5j6-7890-abcd-444444444444
status: experimental
description: Detects exception handler debugger checks
author: Infinit3i
date: 2026/04/27
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  EventID: 1
  CommandLine|contains:
      - 'SetUnhandledExceptionFilter'
      - 'AddVectoredExceptionHandler'
      - 'RaiseException'
      - 'UnhandledExceptionFilter'
  condition: selection
tags:
  - attack.defense_evasion
  - attack.t1622
  - windows
  - sysmon
