title: Suspicious WMI-Based Execution (Wmiprvse Spawning Scripting Engines)
id: c682cb7c-7231-45a4-89ec-5ee6894c14cc
status: experimental
description: Detects suspicious use of WMI where wmiprvse.exe spawns PowerShell, cmd.exe, or other scripting engines.
author: Matthew Iverson
date: 2025/04/20
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection_event:
    EventID:
      - 1
      - 3
  selection_parent:
    ParentImage|endswith: '\wmiprvse.exe'
  selection_child:
    Image|endswith:
      - '\powershell.exe'
      - '\cmd.exe'
      - '\mshta.exe'
      - '\wscript.exe'
      - '\cscript.exe'
  condition: selection_event and selection_parent and selection_child
fields:
  - ParentImage
  - Image
  - CommandLine
  - ProcessId
  - ParentProcessId
  - DestinationIp
  - DestinationPort
  - Protocol
  - ComputerName
falsepositives:
  - Legitimate scripts or automation frameworks using WMI (e.g., SCCM)
  - Domain joined management tools
level: high
tags:
  - attack.execution
  - attack.persistence
  - attack.t1047
  - sysmon
