---
title: Potential Meterpreter Execution Detected
technique: T1219
id: dcoxidm8-abcd-win1-met6-infinit3i456
status: experimental
description: >-
  > Detects potential Meterpreter activity by searching for the string "meterpreter" in process creation events. Meterpreter is a payload commonly used in penetration testing frameworks (e.g., Metasploit) and may indicate unauthorized remote control activity.
author: Infinit3i
date: 2025/04/08
references:
  - https://attack.mitre.org/techniques/T1219/   # MITRE ATT&CK: T1219 - Remote Access Tools
tags:
  - attack.lateral_movement
  - attack.t1219
  - windows
  - sysmon
  - attack.execution
logsource:
  product: windows
  service: sysmon
detection:
  selection:
  EventID:
  CommandLine|contains:
      - meterpreter
  condition: selection
falsepositives:
  - Legitimate penetration testing or red team activities using Meterpreter.
  - Administrative or security tools that might incidentally include the keyword.
level: medium
