---
title: Suspicious Service Creation
technique: T1543.003
id: 76e6d2c2-9d4f-41c0-a56a-847cf50a6470
status: experimental
description: >-
  Detects creation of new services which may indicate attacker persistence. Uses Windows System Event ID 7045 and correlated process creation from Sysmon.
author: Infinit3i
date: 2025/04/20
logsource:
  product: windows
detection:
  windows_event:
  EventID:
  sysmon_process:
  EventID:
  CommandLine|contains:
      - 'sc create'
      - 'New-Service'
      - 'srvany.exe'
      - 'powershell'
      - 'service'
  condition: windows_event or sysmon_process
fields:
  - ServiceName
  - ServiceFileName
  - CommandLine
  - Image
  - User
  - ComputerName
falsepositives:
  - Software installation
  - Legitimate administrative service setup
level: high
tags:
  - attack.persistence
  - attack.t1543.003
  - windows
  - sysmon
  - attack.privilege_escalation
  - attack.t1543
