title: WMI Event Subscription Permanent Event Creation
id: 8b7f9a2c-3d45-4e89-b123-456789abcdef
status: experimental
description: >-
  Detects creation of WMI event subscriptions for persistence through permanent WMI events
author: Infinit3i
date: 2026/04/27
references:
  - https://attack.mitre.org/techniques/T1546/003/
  - https://www.fireeye.com/blog/threat-research/2016/08/wmi_vs_wmi_the_use_of.html
logsource:
  product: windows
  service: sysmon
detection:
  selection_wmi_consumer:
  EventID:
  Destination:
      - '*ActiveScriptEventConsumer*'
      - '*CommandLineEventConsumer*'
      - '*NTEventLogEventConsumer*'
  selection_wmi_filter:
  EventID:
  Query|contains:
      - 'SELECT * FROM Win32_VolumeChangeEvent'
      - 'SELECT * FROM Win32_SystemConfigurationChangeEvent'
      - 'SELECT * FROM Win32_ProcessStartTrace'
  selection_wmi_binding:
  EventID:
  Consumer|contains:
      - 'CommandLineEventConsumer'
      - 'ActiveScriptEventConsumer'
  condition: selection_wmi_consumer or selection_wmi_filter or selection_wmi_binding
fields:
  - EventType
  - Operation
  - Consumer
  - Query
  - Name
falsepositives:
  - Legitimate system administration tools
  - Software installers using WMI
  - Monitoring solutions
level: high
tags:
  - attack.persistence
  - attack.t1546.003
  - sysmon
  - windows
  - wmi
