title: New User Account Created
id: d799d84f-d03f-4a7b-a1a3-3bd12a3e22d2
status: stable
description: Detects creation of new local or domain user accounts using Windows Security Event ID 4720.
author: Matthew Iverson
date: 2025/04/20
logsource:
  product: windows
  service: security
  category: account_management
detection:
  selection_event:
    EventID: 4720
  condition: selection_event
fields:
  - TargetUserName
  - SubjectUserName
  - SubjectDomainName
  - ComputerName
falsepositives:
  - Legitimate user provisioning by IT
level: high
tags:
  - attack.persistence
  - attack.t1136
  - attack.t1136.001
  - windows
