{
  "kind": "Scheduled",
  "properties": {
    "displayName": "Abnormal TLSSSL Certificate Anomalies",
    "description": "Detects suspicious TLS/SSL certificate characteristics from Zeek logs such as self-signed certs, mismatched subject/issuer, or uncommon issuers\u2014potential indicators of malware C2, unauthorized services, or MitM attacks.",
    "severity": "High",
    "enabled": false,
    "query": "CommonSecurityLog\n| where TimeGenerated > ago(24h)\n| where validation_status == \"self signed certificate\" and (issuer|contains has \"CN=localhost\" or issuer|contains has \"CN=example\" or issuer|contains has \"CN=fake\") and subject startswith \"CN=\" and issuer startswith \"CN=\" and subject contains \"test\"",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "a1b2c3d4-e5f6-7890-abcd-1234567890ef",
      "SigmaLevel": "high",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/04/08"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T003",
      "T1557"
    ]
  }
}