{
  "kind": "Scheduled",
  "properties": {
    "displayName": "Audit Policy Change or Clearing Attempt",
    "description": "Detects audit policy changes (Event ID 4719) and correlates with suspicious tools that modify or clear logs (auditpol, secedit, wevtutil).",
    "severity": "High",
    "enabled": false,
    "query": "union Event, SecurityEvent\n| where TimeGenerated > ago(24h)\n| where (CommandLine|contains has \"auditpol\" or CommandLine|contains has \"secedit\" or CommandLine|contains has \"wevtutil cl\")",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "8f94eb0d-3aa2-4a9a-953d-cafbe548732f",
      "SigmaLevel": "high",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/04/20"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T1562",
      "T002"
    ]
  }
}