{
  "kind": "Scheduled",
  "properties": {
    "displayName": "Brute-Force SSH Attempts",
    "description": "Detects repeated failed SSH login attempts using Zeek logs by identifying high volumes of connection attempts with 'failed' authentication results from a single source.",
    "severity": "High",
    "enabled": false,
    "query": "CommonSecurityLog\n| where TimeGenerated > ago(24h)\n| where auth_success == \"F\"",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "f9c8123a-4567-4e9b-a012-abcdef123456",
      "SigmaLevel": "high",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/04/08"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T001"
    ]
  }
}