{
  "kind": "Scheduled",
  "properties": {
    "displayName": "Cloud Account Credential Use from Unregistered or Inactive Devices",
    "description": "Detects successful logins using valid cloud credentials from unregistered, unmanaged, or inactive devices \u2014 potentially indicating credential theft or reuse.",
    "severity": "High",
    "enabled": false,
    "query": "AWSCloudTrail\n| where TimeGenerated > ago(24h)\n| where eventName == \"ConsoleLogin\" and additionalEventData.MFAUsed == \"No\" and userIdentity.type == \"IAMUser\" and (sourceIPAddress has \"10.*\" or sourceIPAddress has \"192.168.*\")",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "9b3d5d64-b1f2-48f8-bb12-2222bbbb2222",
      "SigmaLevel": "critical",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/10/19"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T1078",
      "T004"
    ]
  }
}