{
  "kind": "Scheduled",
  "properties": {
    "displayName": "Enabling RDP Through Firewall Modification Detected",
    "description": "Detects modification of Windows Firewall rules that enable Remote Desktop Protocol (RDP). This rule looks for events (e.g. EventID 4946) that indicate a firewall rule change where the rule involves port 3389 or mentions \"Remote Desktop\". This behavior can be indicative of an adversary enabling RDP for remote access.\n",
    "severity": "Medium",
    "enabled": false,
    "query": "SecurityEvent\n| where TimeGenerated > ago(24h)\n| where (Message|contains has \"3389\" or Message|contains has \"Remote Desktop\")",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "0e2a15fa-1234-5678-9abc-def098765432",
      "SigmaLevel": "medium",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/04/08"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T1562"
    ]
  }
}