{
  "kind": "Scheduled",
  "properties": {
    "displayName": "New User Account Created",
    "description": "Detects creation of new local or domain user accounts using Windows Security Event ID 4720.",
    "severity": "High",
    "enabled": false,
    "query": "SecurityEvent\n| where TimeGenerated > ago(24h)",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "d799d84f-d03f-4a7b-a1a3-3bd12a3e22d2",
      "SigmaLevel": "high",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/04/20"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T1136",
      "T001"
    ]
  }
}