{
  "kind": "Scheduled",
  "properties": {
    "displayName": "Suspicious Web-based Command and Control Patterns",
    "description": "Detects suspicious web-based command and control communication patterns",
    "severity": "Medium",
    "enabled": false,
    "query": "CommonSecurityLog\n| where TimeGenerated > ago(24h)\n| where (user_agent|contains has \"Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1)\" or user_agent|contains has \"Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1)\" or user_agent|contains has \"Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1)\" or user_agent|contains has \"python-requests\" or user_agent|contains has \"python-urllib\" or user_agent|contains has \"curl\" or user_agent|contains has \"wget\" or user_agent|contains has \"PowerShell\" or user_agent|contains has \"WinHTTP\" or user_agent|contains has \"\") and method == \"POST\" and request_body_len == \">1024\" and (uri|contains has \"/admin\" or uri|contains has \"/panel\" or uri|contains has \"/gate\" or uri|contains has \"/log\" or uri|contains has \"/upload\" or uri|contains has \"/download\" or uri|contains has \"/data\" or uri|contains has \".php?id=\" or uri|contains has \".aspx?id=\" or uri|contains has \".jsp?id=\") and request_body_len == \"<100\" and status_code == \"200\"",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "j0k1l2m3-n4o5-6789-0123-456789jklmno",
      "SigmaLevel": "medium",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2026/04/27"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T001"
    ]
  }
}