{
  "kind": "Scheduled",
  "properties": {
    "displayName": "Suspicious Cloud Account Logins from New Geolocations",
    "description": "Detects cloud logins from unusual geolocations or impossible travel patterns, possibly indicating stolen credentials or compromised cloud accounts.",
    "severity": "High",
    "enabled": false,
    "query": "SigninLogs\n| where TimeGenerated > ago(24h)\n| where (Location has \"*\") and (Location has \"United States\" or Location has \"Canada\")",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "7b5c7b43-fd62-4f6d-91a8-1111aaaa1111",
      "SigmaLevel": "high",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/10/19"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T1078",
      "T004"
    ]
  }
}