{
  "kind": "Scheduled",
  "properties": {
    "displayName": "Unusual File Transfer Activity",
    "description": "Detects unusual file transfer activity using Zeek logs, such as large file sizes, executable/script MIME types, or transfers over unexpected protocols like FTP or HTTP instead of secure channels.",
    "severity": "High",
    "enabled": false,
    "query": "CommonSecurityLog\n| where TimeGenerated > ago(24h)\n| where (mime_type|contains has \"application/x-dosexec\" or mime_type|contains has \"application/x-sh\" or mime_type|contains has \"application/x-executable\" or mime_type|contains has \"application/x-msdownload\") and tx_hosts contains \"ftp\"",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "b789c2f1-45e6-4d91-abcd-0987654321ef",
      "SigmaLevel": "high",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/04/08"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T1048"
    ]
  }
}