{
  "kind": "Scheduled",
  "properties": {
    "displayName": "Utility Abuse Regsvr32 Rundll32 etc",
    "description": "Detects the execution of legitimate Windows utilities (e.g., regsvr32.exe, rundll32.exe) that may be abused to execute arbitrary code, load malicious DLLs, or bypass security controls.",
    "severity": "Medium",
    "enabled": false,
    "query": "union Event, SecurityEvent\n| where TimeGenerated > ago(24h)\n| where Image endswith \"regsvr32.exe\" and Image endswith \"rundll32.exe\"",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "7bd3a9ce-4f1e-4b5c-bd3e-1234567890ab",
      "SigmaLevel": "medium",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/04/08"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T011"
    ]
  }
}