{
  "kind": "Scheduled",
  "properties": {
    "displayName": "WMI Win32_ProcessCreate Executed Remotely WMI-Activity",
    "description": "Flags remote WMI method execution of Win32_Process.Create via WMI-Activity Operational log (commonly used for lateral movement).",
    "severity": "High",
    "enabled": false,
    "query": "union Event, SecurityEvent\n| where TimeGenerated > ago(24h)\n| where (Message|contains|all has \"Win32_Process.Create\" or Message|contains|all has \"Execute Method\") and (Message|contains has \"ClientMachine=localhost\" or Message|contains has \"ClientMachine=127.0.0.1\")",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "6f2e9b12-3a0a-4b7a-9b31-0000aaaawmi2",
      "SigmaLevel": "critical",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/10/19"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T1047"
    ]
  }
}