{
  "kind": "Scheduled",
  "properties": {
    "displayName": "WMI Activity - Win32_Process Query",
    "description": "Detects WMI queries against Win32_Process in the WMI-Activity Operational log (remote or local process discovery).",
    "severity": "High",
    "enabled": false,
    "query": "union Event, SecurityEvent\n| where TimeGenerated > ago(24h)\n| where (Query|contains has \"Select * from Win32_Process\" or Query|contains has \"select Name,ProcessId from Win32_Process\") and Consumer contains \"Win32_Process\"",
    "queryFrequency": "PT15M",
    "queryPeriod": "PT24H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT1H",
    "suppressionEnabled": false,
    "alertRuleTemplateName": null,
    "incidentConfiguration": {
      "createIncident": true,
      "groupingConfiguration": {
        "enabled": false,
        "reopenClosedIncident": false,
        "lookbackDuration": "PT5H",
        "matchingMethod": "AllEntities",
        "groupByEntities": [],
        "groupByAlertDetails": [],
        "groupByCustomDetails": []
      }
    },
    "eventGroupingSettings": {
      "aggregationKind": "SingleAlert"
    },
    "alertDetailsOverride": null,
    "customDetails": {
      "SigmaRuleId": "a1057a01-1111-4c11-8a57-000000000004",
      "SigmaLevel": "high",
      "SigmaAuthor": "Matthew Iverson",
      "SigmaDate": "2025/10/19"
    },
    "entityMappings": [
      {
        "entityType": "Account",
        "fieldMappings": [
          {
            "identifier": "Name",
            "columnName": "Account"
          }
        ]
      },
      {
        "entityType": "Host",
        "fieldMappings": [
          {
            "identifier": "HostName",
            "columnName": "Computer"
          }
        ]
      }
    ],
    "sentinelEntitiesMappings": null,
    "templateVersion": null,
    "tactics": [],
    "techniques": [
      "T1057"
    ]
  }
}