---
title: HTTP Tunneling Detection
id: j1k2l3m4-n5o6-7890-abcd-444444444444
status: experimental
author: Matthew Iverson
date: 2026/04/27
logsource:
  product: zeek
  service: http
detection:
  selection:
    method: 'CONNECT'
    status_code: '200'
    response_body_len: '>1000'
  condition: selection
tags:
  - attack.command-and-control
  - attack.t1071.001

