---
title: HTTP Tunneling Detection
technique: T1071.001
id: j1k2l3m4-n5o6-7890-abcd-444444444444
status: experimental
author: Infinit3i
date: 2026/04/27
logsource:
  product: zeek
  service: http
detection:
  selection:
  method:
  status_code:
  response_body_len:
  condition: selection
tags:
  - attack.command_and_control
  - attack.t1071.001
  - windows
  - sysmon
  - attack.command-and-control
