---
title: Domain Generation Algorithm Detection
technique: T1071.001
id: i1j2k3l4-m5n6-7890-abcd-444444444444
status: experimental
author: Infinit3i
date: 2026/04/27
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|re:
  condition: selection
tags:
  - attack.command_and_control
  - attack.t1071.001
  - windows
  - sysmon
  - attack.command-and-control
  - attack.t1071.004
