---
title: Base64 Encoded C2 Communication
technique: T1071.001
id: j1k2l3m4-n5o6-7890-abcd-333333333333
status: experimental
author: Infinit3i
date: 2026/04/27
logsource:
  product: zeek
  service: http
detection:
  selection:
  request_body_len:
  uri|contains:
      - '?data='
      - '&cmd='
      - 'payload='
  post_data|re:
    condition: selection
tags:
  - attack.command_and_control
  - attack.t1071.001
  - windows
  - sysmon
  - attack.command-and-control
