title: Unusual Process Making Network Connection
id: b8a8d7b1-77c4-42ea-8dd5-21290fefaa51
status: experimental
description: Detects outbound network activity from suspicious or abused processes like powershell.exe, regsvr32.exe, rundll32.exe, or mshta.exe using Sysmon Event ID 3.
author: Matthew Iverson
date: 2025/04/20
logsource:
  product: windows
  service: sysmon
  category: network_connection
detection:
  selection_event:
    EventID: 3
  selection_process:
    Image|endswith:
      - '\powershell.exe'
      - '\regsvr32.exe'
      - '\mshta.exe'
      - '\rundll32.exe'
  condition: selection_event and selection_process
fields:
  - Image
  - DestinationIp
  - DestinationPort
  - Protocol
  - Initiated
  - ProcessId
  - ComputerName
falsepositives:
  - Legitimate automation or admin tools
  - Internal management scripts
level: high
tags:
  - attack.command_and_control
  - attack.t1105
  - sysmon
