title: FTP File Transfer Activities
id: i1j2k3l4-m5n6-7890-abcd-222222222222
status: experimental
author: Matthew Iverson
date: 2026/04/27
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    CommandLine|contains:
      - 'ftp.exe'
      - 'sftp'
      - 'ftps'
      - 'wget ftp://'
      - 'curl ftp://'
      - 'tftp'
      - 'Put-FtpFile'
      - 'Get-FtpFile'
  condition: selection
tags:
  - attack.command-and-control
  - attack.t1105