title: Hidden File and Folder Discovery
id: f1g2h3i4-j5k6-7890-abcd-111111111111
status: experimental
description: Detects discovery of hidden files and folders
author: Matthew Iverson
date: 2026/04/27
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    CommandLine|contains:
      - 'dir /ah'
      - 'dir /a:h'
      - 'attrib +h'
      - 'Get-ChildItem -Force'
      - 'Get-ChildItem -Hidden'
      - 'ls -la'
      - 'find . -name ".*"'
  condition: selection
tags:
  - attack.discovery
  - attack.t1083