---
title: Database File Discovery
id: f1g2h3i4-j5k6-7890-abcd-555555555555
status: experimental
author: Matthew Iverson
date: 2026/04/27
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    CommandLine|contains:
      - '*.mdb'
      - '*.mdf'
      - '*.ldf'
      - '*.accdb'
      - '*.db'
      - '*.sqlite'
      - '*.sqlite3'
      - '*.dbf'
      - '*.frm'
      - '*.ibd'
      - '*.wal'
  condition: selection
tags:
  - attack.discovery
  - attack.t1083
